# Homebrew Bundle
# https://github.com/Homebrew/homebrew-bundle

# CLI Tools
brew "zsh"
brew "sheldon"
brew "coreutils"
brew "tree"
brew "wget"
brew "yarn"
brew "tldr"
brew "mas"
brew "node"
brew "git"
# Desktop applications
cask "telegram"
cask "google-chrome"
cask "firefox"
cask "visual-studio-code"
cask "slack"
cask "steam"
cask "1password"
cask "notion"
cask "docker"
cask "hyper"
cask "swiftformat-for-xcode"
cask "swiftlint"
cask "discord"
cask "whatsapp"
cask "spark"
cask "drawio"
cask "figma"
cask "skitch"
cask "expressions"
cask "battle-net"
cask "java" unless system "/usr/libexec/java_home --failfast"

# Quick Look plugins
cask "qlcolorcode" # https://github.com/anthonygelibert/QLColorCode
cask "qlstephen" # https://github.com/whomwah/qlstephen
cask "quicklook-json" # https://github.com/sindresorhus/quick-look-plugins
cask "qlimagesize" # https://github.com/Nyx0uf/qlImageSize
cask "webpquicklook" # https://github.com/dchest/webp-quicklook

